Revit 2027 API
ElementBinding Properties
The ElementBinding type exposes the following members.
Properties
Name | Description
Categories | Retrieve or set the categories to which a parameter definition will be bound.
IsReadOnly | Identifies if the object is read-only or modifiable.
(Inherited from APIObject)
Top
See Also
Reference
ElementBinding Class
Autodesk.Revit.DB Namespace